eu.alert-project.iccs.events.core/src/test/resources/ALERT.KEUI.IssueNew.Annotated.Review.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <soap:Header></soap:Header>
    <soap:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>METADATASERVICE</ns1:sender>
                            <ns1:timestamp>10003</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10020</ns1:endTime>
                                <ns1:eventName>ALERT.KEUI.IssueNew.Annotated</ns1:eventName>
                                <ns1:eventId>5748</ns1:eventId>
                                <ns1:eventType>reply</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <s:kesi>
    <s:issueActivity>
        <s:activityAdded>drf54321</s:activityAdded>
        <s:activityRemoved></s:activityRemoved>
        <s:activityWhat>CC</s:activityWhat>
        <s:activityWhen>2008-11-01 14:15:23.0</s:activityWhen>
        <s:activityWho>drf</s:activityWho>
    </s:issueActivity>
    <s:issueAssignedTo>
        <s:email>drf</s:email>
        <s:name>Dario Freddi</s:name>
        <s:id>drf</s:id>
    </s:issueAssignedTo>
    <s:issueComment>
        <s:commentText>Version:            (using KDE 4.1.2) 
 OS:                Linux 
 Installed from:    SuSE RPMs 
 
 Currently, Powerdevil will set the brightness of the screen to a certain level according to the profile that corresponds to the battery state.  This is fine... for most situations.  However, there are some situations where it runs counter to what the user obviously wants. 
 
 Key point: 
 If I have lowered the brightness of my screen (to reduce glare, or because it ' s dark), and my battery level lowers enough to trigger a new Powerdevil profile, the brightness will be _set_ to the level specified by the profile, which is, in most cases, _higher_ than what I had set it to manually.  This obviously runs /counter/ to preserving battery life, as the screen suddenly becomes _brighter_. 
 
 Suggested solution: 
 I feel that it would be better for Powerdevil to first check if the brightness level is already lower than that of the next profile, and if it is, not to set the brightness. 
 Alternatively, it would be even nicer if the brightness slider had an  " advanced "  option showing a max setting for brightness, allowing one to set the max end of the range of possible brightness for a profile, the default one being specified by the normal slider.  This would be difficult to be done in a nice-UI fashion, but might offer just the right level of flexibility most users would want in this situation.  (As a disclaimer, whatever solution taken is obviously up to the developer, I ' m just throwing out ideas.)</s:commentText>
        <s:commentPerson>
            <s:email>alex</s:email>
            <s:name>Nicholas Marquez</s:name>
            <s:id>alex</s:id>
        </s:commentPerson>
        <s:commentDate>2008-10-30T00:00:00+01:00</s:commentDate>
    </s:issueComment>
    <s:issueComputerSystem>
        <s:computerSystemOS>Linux</s:computerSystemOS>
        <s:computerSystemPlatform>openSUSE RPMs</s:computerSystemPlatform>
    </s:issueComputerSystem>
    <s:issueDateOpened>2008-10-30T00:00:00+01:00</s:issueDateOpened>
    <s:issueDescription>Powerdevil sets backlight without regards to current level</s:issueDescription>
    <s:issueId>173930</s:issueId>
    <s:issueTracker>
        <type>bugzilla</type>
        <URI>https://bugs.kde.org/</URI>
        <s:issueTrackerType>bugzilla</s:issueTrackerType>
        <s:issueTrackerURL>https://bugs.kde.org/</s:issueTrackerURL>
    </s:issueTracker>
    <s:issueUrl>https://bugs.kde.org/show_bug.cgi?id=173930</s:issueUrl>
    <s:issueLastModified>2010-11-09T00:00:00+01:00</s:issueLastModified>
    <s:issueMilestone>
        <s:milestoneId>---</s:milestoneId>
    </s:issueMilestone>
    <s:issuePriority></s:issuePriority>
    <s:issueProduct>
        <s:productComponentId>powermanagement-daemon</s:productComponentId>
        <s:productId>solid</s:productId>
        <s:productVersion>unspecified</s:productVersion>
    </s:issueProduct>
    <s:issueAuthor>
        <s:email>alex</s:email>
        <s:name>Nicholas Marquez</s:name>
        <s:id>alex</s:id>
    </s:issueAuthor>
    <s:issueResolution>OPEN</s:issueResolution>
    <s:issueSeverity></s:issueSeverity>
    <s:issueStatus>Open</s:issueStatus>
</s:kesi>
                                <o:mdservice>
                                    <o:issueUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug25</o:issueUri>
                                    <o:issueActivity>
                                        <o:activityUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Activity343</o:activityUri>
                                        <o:activityWhoUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</o:activityWhoUri>
                                    </o:issueActivity>
                                    
                                    <o:issueCCPersonUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</o:issueCCPersonUri>
                                    <o:issueComment>
                                        <o:commentUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Comment282</o:commentUri>
                                        <o:commentPersonUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person118</o:commentPersonUri>
                                    </o:issueComment>
                                    <o:issueComputerSystem>
                                        <o:issueComputerSystemUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#ComputerSystem25</o:issueComputerSystemUri>
                                    </o:issueComputerSystem>
                                    <o:issueMilestone>
                                        <o:issueMilestoneUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Milestone1</o:issueMilestoneUri>
                                    </o:issueMilestone>
                                    <o:issueAuthorUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person118</o:issueAuthorUri>
                                    <o:issueAssignedToUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</o:issueAssignedToUri>
                                    <o:issueProduct>
                                        <o:productComponentUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Component1</o:productComponentUri>
                                        <o:productUri>http://www.ifi.uzh.ch/ddis/evoont/2008/11/bom#Product1</o:productUri>
                                    </o:issueProduct>
                                </o:mdservice>
                            
								<s1:keui>
									<s1:issueDescriptionAnnotated><![CDATA[Powerdevil <concept id="http://ailab.ijs.si/alert/resource/r14650">sets</concept> <concept id="http://ailab.ijs.si/alert/resource/r6178">backlight</concept> without regards to current level]]></s1:issueDescriptionAnnotated>
									<s1:issueDescriptionConcepts><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r14650</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r6178</s1:uri><s1:weight>1</s1:weight></s1:concept></s1:issueDescriptionConcepts>
									<s1:issueComment>
										<s1:commentTextAnnotated><![CDATA[<concept id="http://ailab.ijs.si/alert/resource/r18520">Version</concept>:            (using <concept id="http://ailab.ijs.si/alert/resource/r14859">KDE</concept> 4.1.<concept id="http://ailab.ijs.si/alert/resource/r17814">2</concept>) 
 OS:                <concept id="http://ailab.ijs.si/alert/resource/r14937">Linux</concept> 
 <concept id="http://ailab.ijs.si/alert/resource/installed">Installed</concept> from:    <concept id="http://ailab.ijs.si/alert/resource/r16720">SuSE</concept> RPMs 
 
 Currently, Powerdevil will <concept id="http://ailab.ijs.si/alert/resource/r14650">set</concept> the brightness of the <concept id="http://ailab.ijs.si/alert/resource/r1187">screen</concept> to a certain level according to the <concept id="http://ailab.ijs.si/alert/resource/r17263">profile</concept> that corresponds to the <concept id="http://ailab.ijs.si/alert/resource/r3368">battery</concept> state.  This is fine... for most situations.  However, there are some situations where it runs <concept id="http://ailab.ijs.si/alert/resource/r176">counter</concept> to what the <concept id="http://ailab.ijs.si/alert/resource/r12142">user</concept> obviously wants. 
 
 <concept id="http://ailab.ijs.si/alert/resource/r10388">Key</concept> point: 
 If I have lowered the brightness of my <concept id="http://ailab.ijs.si/alert/resource/r1187">screen</concept> (to reduce glare, or because it ' <concept id="http://ailab.ijs.si/alert/resource/r16797">s</concept> dark), and my <concept id="http://ailab.ijs.si/alert/resource/r3368">battery</concept> level lowers enough to <concept id="http://ailab.ijs.si/alert/resource/r10830">trigger</concept> a new Powerdevil <concept id="http://ailab.ijs.si/alert/resource/r17263">profile</concept>, the brightness will be _set_ to the level specified by the <concept id="http://ailab.ijs.si/alert/resource/r17263">profile</concept>, which is, in most cases, _higher_ than what I had <concept id="http://ailab.ijs.si/alert/resource/r14650">set</concept> it to manually.  This obviously runs /<concept id="http://ailab.ijs.si/alert/resource/r176">counter</concept>/ to preserving <concept id="http://ailab.ijs.si/alert/resource/r3368">battery</concept> life, as the <concept id="http://ailab.ijs.si/alert/resource/r1187">screen</concept> suddenly becomes _brighter_. 
 
 Suggested solution: 
 I feel that it would be better for Powerdevil to first check if the brightness level is already lower than that of the <concept id="http://ailab.ijs.si/alert/resource/r588">next</concept> <concept id="http://ailab.ijs.si/alert/resource/r17263">profile</concept>, and if it is, not to <concept id="http://ailab.ijs.si/alert/resource/r14650">set</concept> the brightness. 
 Alternatively, it would be even nicer if the brightness slider had an  " advanced "  <concept id="http://ailab.ijs.si/alert/resource/r9241">option</concept> showing a max <concept id="http://ailab.ijs.si/alert/resource/r14650">setting</concept> for brightness, allowing one to <concept id="http://ailab.ijs.si/alert/resource/r14650">set</concept> the max end of the <concept id="http://ailab.ijs.si/alert/resource/r17329">range</concept> of possible brightness for a <concept id="http://ailab.ijs.si/alert/resource/r17263">profile</concept>, the default one being specified by the normal slider.  This would be difficult to be <concept id="http://ailab.ijs.si/alert/resource/r6204">done</concept> in a nice-<concept id="http://ailab.ijs.si/alert/resource/r17442">UI</concept> fashion, but might offer just the <concept id="http://ailab.ijs.si/alert/resource/r11876">right</concept> level of flexibility most <concept id="http://ailab.ijs.si/alert/resource/r12142">users</concept> would want in this situation.  (As a disclaimer, whatever solution taken is obviously <concept id="http://ailab.ijs.si/alert/resource/r8553">up</concept> to the developer, I ' m just throwing out <concept id="http://ailab.ijs.si/alert/resource/r2121">ideas</concept>.)]]></s1:commentTextAnnotated>
										<s1:commentTextConcepts><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r18520</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r14859</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r17814</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r14937</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/installed</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r16720</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r14650</s1:uri><s1:weight>5</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r1187</s1:uri><s1:weight>3</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r17263</s1:uri><s1:weight>5</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r3368</s1:uri><s1:weight>3</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r176</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r12142</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r10388</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r16797</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r10830</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r588</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r9241</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r17329</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r6204</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r17442</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r11876</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r8553</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/r2121</s1:uri><s1:weight>1</s1:weight></s1:concept></s1:commentTextConcepts>
										<s1:itemId>5694</s1:itemId></s1:issueComment>
										<s1:threadId>24</s1:threadId>
								</s1:keui>
							</ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </soap:Body>
</soap:Envelope>
